---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadCombination.Type
zh: 类型
source: html/a8032183-6581-bc85-17b6-73be32d84207.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.Type Property

**中文**: 类型

The type of the load combination.

## Syntax (C#)
```csharp
public LoadCombinationType Type { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration